       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-1 PIC 9(3) VALUE 0.
       01 NUM-2 PIC 9(3) VALUE 0.
       01 TOTAL-RESULT PIC 9(4) VALUE 0.
       
       PROCEDURE DIVISION.
       CALCULATOR-MAIN.
       DISPLAY "DIGITE UM NÚMERO QUALQUER.".
       ACCEPT NUM-1.
       DISPLAY "DIGITE SEGUNDO NÚMERO"
       ACCEPT NUM-2.
       COMPUTE TOTAL-RESULT = NUM-1 + NUM-2.
       DISPLAY TOTAL-RESULT.
       STOP RUN.       