       IDENTIFICATION DIVISION.
            PROGRAM-ID. ola-mundo.
       PROCEDURE DIVISION.
            DISPLAY 'Ola do COBOL no GitHub Codespaces!'.
            STOP RUN.